<template>
  <ui-Modal
    v-if="showTemplateModal"
    :text="t('signup.create_account')"
    close-icon
    header
    width="600px"
    class="w-full lg:max-w-[530px] max-h-[500px]"
    @close="$emit('close')"
  >
    <template #body>
      <div
        ref="scrollContainer"
        class="block border border-border-divider rounded-sm overflow-scroll max-h-[250px] mb-md p-sm"
        @scroll="onScroll"
        v-html="rules"
      ></div>
      <ui-Checkbox
        :label="$t('signup.accept_roles')"
        :loading="loading"
        :checked="isChecked"
        :disabled="loading"
        class="ml-2xs"
        name="selected"
        @change="onChange"
      />
      <ui-InlineMessage
        type="warning"
        :description="$t('signup.create_account_hint')"
        class="mb-md"
      />
      <ui-Button
        :disabled="!scrolledToEnd || !isChecked"
        :loading="loading"
        class="w-full"
        :text="$t('signup.create_account')"
        @click="$emit('next')"
      />
    </template>
  </ui-Modal>
</template>
<script lang="ts" setup>
const isChecked = ref(false);
defineProps<{
  showTemplateModal: boolean;
  loading: boolean;
}>();
defineEmits(['close', 'next']);
const rules =
  'باتوجه به وجود ریسک بالای سرمایه‌گذاری در طرح‌های تامین مالی جمعی، به موجب این اقرارنامه تامین کنندگان (سرمایه‌گذران) اذعان مینماید که با اطلاع دقیق و آگاهی کافی در خصوص ماهیت اینگونه طرحها نسبت به سرمایه گذاری در آنها اقدام مینماید.\n' +
  'این پلتفرم یک سکوی تامین مالی جمعی، تائید شده توسط کارگروه ارزیابی تامین مالی جمعی مستقر در شرکت فرابورس ایران است و بر اساس قوانین و مقررات جمهوری اسلامی ایران و دستورالعمل تامین مالی جمعی مصوب شورای عالی بورس و اوراق بهادار فعالیت می نماید.\n' +
  'اگر چه سرمایه گذاری در طرح های تامین مالی جمعی در سکوی زرین کراد، می تواند بسیار سودآور باشد، اما ریسک هایی نیز دارد. تامین کنندگان (سرمایه گذاران) محترم می‌بایست نسبت به ریسک‌های پیش روی خود از جمله کاهش سرمایه، از بین رفتن سرمایه، عدم نقد شوندگی، عدم کسب سود و غیره شناخت لازم را داشته باشند. بدیهی است سرمایه گذاری در طرح های سکوی زرین کراد به معنای مطالعه و پذیرش قوانین سکو و بیانیه ریسک می باشد.\n' +
  'ما تلاش می‌کنیم تا اطلاعات جامعی از جنبه‌های مختلف طرح‌ها را در اختیار مشارکت‌کنندگان قرار دهیم. با این وجود، تمامی اطلاعات ارائه شده در پلتفرم توسط صاحبان طرح‌ها (متقاضیان) ارائه شده‌ و زرین کراد مسوولیتی در برابر کامل بودن اطلاعات یا قابل اجرا بودن برنامه‌های ارائه شده توسط متقاضیان ندارد. زرین کراد با عقد قرارداد با متقاضی، دریافت تعهدات لازم و همچنین دریافت مستنداتی نظیر گواهی عدم سوء پیشینه تمامی اعضای هیات مدیره یا مجوزهای اخذ شده توسط متقاضی، سعی می‌کند تا ریسک‌های تصمیم‌گیری مشارکت‌کنندگان را کاهش دهد؛ ولی به‌طور صریح و روشن هر نوع مسوولیتی در برابر هر نوع ضرر ناشی از اتكاء به تمام با بخشی از این اطلاعات را از خود سلب می‌کند. لذا مشارکت‌کنندگان باید به ارزیابی خودشان از متقاضی و شناخت مزیت‌ها و ریسک‌های طرح اتكا کرده و در زمان مشارکت به هنگام بروز هرگونه شک و تردید، با افراد واجد صلاحیت مشاوره نمایند.\n' +
  'همچنین مطابق ماده 2 دستورالعمل تامین مالی جمعی، مصوب شورای عالی بورس و اوراق بهادار، تامین کننده در سود و زیان طرح شریک است. و با توجه به ماهیت طرح‌های تامین مالی جمعی امکان عدم کسب سود در این طرح‌ها وجود دارد.\n' +
  'از آنجایی که مشارکت‌کنندگان در سود و زیان اجرای طرح شریک هستند، شما به عنوان مشارکت‌کننده در طرح ممکن است تمام یا بخشی از سرمایه خود را از دست دهید. لذا توصیه ما به شما این است که به اندازه توان پذیرش ریسک از دست رفتن سرمایه خود سرمایه‌گذاری کنید و همچنین برای کاهش ریسک، سرمایه خود را بین طرح‌های مختلف پخش کنید. فرصت های سرمایه گذاری پس از بررسی و ارزیابی در سکوی زرین کراد به نمایش گذاشته می شود و سرمایه گذاران می توانند از میان این طرح ها، طرح مورد نظر خود را انتخاب و با در نظر گرفتن ریسک های مربوطه، اقدام به سرمایه گذاری نمایند.\n' +
  'توجه داشته باشید که امکان لغو مشارکت در طرح‌ها وجود ندارد. در برخی از طرح ها امکان معاملات ثانویه فراهم شده است که باید به این مطلب در فراخوان توجه کرد. سرمایه گذاران باید مطلع باشند علی رغم وجود بازار ثانویه، یافتن خریدار یا فروشنده برای طرح ها، ممکن است دشوار باشد. لذا با توجه به عدم وجود قابلیت نقدشوندگی هیچگونه مسئولیتی متوجه فرابورس ایران، عامل و نهاد مالی نخواهد بود.\n' +
  'در زمان اجرا نیز مشارکت‌کنندگان کنترلی بر مجری طرح نداشته و صرفا از طریق گزارش‌های ارائه شده مجری طرح در جریان پیشرفت فعالیت‌ها قرار می‌گیرند. سکوی زرین کراد با انتشار گزارشات دوره ای بنا دارد تا این ریسک را برای سرمایه گذار به حداقل برساند.\n' +
  'در صورتی‌که سوال، پیشنهاد، انتقاد و یا هر ابهامی در خصوص این "بیانیه هشدار ریسک" دارید، خواهشمند است از طریق crowd@zarin.com با ما در میان بگذارید.';
const t = useI18n();
const scrolledToEnd = ref(false);
const scrollContainer = ref<HTMLDivElement | null>(null);
const onScroll = () => {
  if (!scrollContainer.value || scrolledToEnd.value) {
    return;
  }

  const el = scrollContainer.value;
  const isAtBottom = el.scrollTop + el.clientHeight >= el.scrollHeight;

  if (isAtBottom) {
    scrolledToEnd.value = true;
  }
};
const onChange = (event: Event) => {
  isChecked.value = (event.target as HTMLInputElement).checked;
};
</script>
<style lang="scss" scoped>
.main {
  @apply lg:flex-row flex-col gap-sm;
  direction: rtl;
  &__item--detail {
    @apply flex justify-between w-full gap-xs p-md  border-b border-border-divider;
  }
  &__item--heading {
    @apply text-body-400-b2 flex flex-col ml-[-1px] mb-[-1px]  min-w-[200px]  ml-[-1px] mb-[-1px]  gap-xs;
  }
}
.rtl {
  direction: rtl;
}

// .main__item--heading {
//   flex: 1 0 2%;
// }
</style>
